자음_dict = {
        'q': (0, 0), 'w': (1, 0), 'e': (2, 0), 'r': (3, 0), 't': (4, 0),
        'a': (0, 1), 's': (1, 1), 'd': (2, 1), 'f': (3, 1), 'g': (4, 1),
        'z': (0, 2), 'x': (1, 2), 'c': (2, 2), 'v': (3, 2),
}

모음_dict = {
        'y': (1, 0), 'u': (2, 0), 'i': (3, 0), 'o': (4, 0), 'p': (5, 0),
        'h': (1, 1), 'j': (2, 1), 'k': (3, 1), 'l': (4, 1),
        'b': (0, 2), 'n': (1, 2), 'm': (2, 2),
}

자음, 모음 = input().split()
자음_x, 자음_y = 자음_dict[자음]
모음_x, 모음_y = 모음_dict[모음]

S = input()
result = 0
for s in S:
    if s in 자음_dict:
        x, y = 자음_dict[s]
        result += abs(자음_x - x) + abs(자음_y - y) + 1
        자음_x, 자음_y = x, y
    else:
        x, y = 모음_dict[s]
        result += abs(모음_x - x) + abs(모음_y - y) + 1
        모음_x, 모음_y = x, y

print(result)
